/**********************************************************************************************************************
overview:    
        1、紫外线杀菌模块的控制
        2、门锁的控制
************************************************************************************************************************/
#include "r_cg_macrodriver.h"
#include "r_cg_pclbuz.h"

#include "h_type_define.h"
#include "m_ad.h"
#include "m_peripheral_control.h"

//函数声明
void sterilize_deal(void);
void sterilize_monitor(void);
void lock_deal(void);


//标志
flag_type flg_peripheral;


//变量
uint16_t gus_max_sterilization_time;     //最大杀菌时间
uint8_t  guc_sterilization_type;         //杀菌模式收的/自动
uint8_t  guc_lock_state;                 //锁的状态
uint8_t  guc_door_state;                 //门的状态


/*********************************************************************************************************************************************
函数功能： 对杀菌模块的处理
            杀菌模块要求：
            1、ON的时间必须大于500mS小于3S；
            2、施加ON/OFF脉冲信号的占空比必须小于30%。

            新改：
            #define _BEBB_TAU_TDR02_VALUE                   (0xBEBBU)
            CH2 ----周期100s------48827 + 1 = 48828
            CH3 ----要求开2s,所以占空比是2/100,CH3 = 2% * 48828 = 976.56 = 977;
            
            1、用硬件Pwm，要开 R_TAU0_Channel2_Start();
            2、只能是从属通道能输出-硬件需接从属通道
      
函数位置：主循环-------------------------------------------ok
**********************************************************************************************************************************************/
void sterilize_deal(void)
{
    STERILIZE_POWER = 1;  //杀菌模块供电开
    TDR03 = 977;          //这样赋值不会重新计时
}


/*********************************************************************************************************************************************
函数功能： 杀菌模块反馈脚的检测，当杀菌模块工作时会检测到2.6v左右的电压；
           当杀菌模块故障时，要断电；
           
           输入电压2.6不能检测到是高电平所以。。。。需AD检测！！！！！！
           判断标准：因100s内开2s,所以在100s内没有检测到电压就 或见功能书
           
函数位置：主循环-------------------------------------------ok
**********************************************************************************************************************************************/
void sterilize_monitor(void)
{
    //debug
    
    guc_sterilize_monitor = 0;
    
}

/*********************************************************************************************************************************************
函数功能： 根据主板发送的指令控制门锁的状态
           
函数位置：主循环-------------------------------------------
**********************************************************************************************************************************************/
void lock_deal(void)
{
    if(guc_door_state == 1)    //开门时一直开锁
    {
        LOCK_STATE = 1;     
    }
    else
    {
        if(guc_lock_state == 1)  //通讯传过来的指令
        {
            LOCK_STATE = 1;      //新板
        }
        else
        {
            LOCK_STATE = 0;          
        }
    }
}





/******************************************END OF THE FILE**********************************************************************************************/
